In [1]:
import numpy as np
import pandas as pd

In [2]:
df_Sales=pd.read_csv('bm_sales.csv')
df_Sales.head()

,date,store_id,sku_id,customer_id,quantity,unit_price,total_value,channel,discount_pct
0,2021-01-01,26,1124,2961.0,1,20.08,20.08,Store,15.0
1,2021-01-01,19,1035,NaN,3,208.57,625.71,Store,15.0
2,2021-01-01,38,1088,NaN,1,17.99,17.99,Website,15.0
3,2021-01-01,3,1164,3694.0,6,196.24,1177.44,Website,0.0
4,2021-01-01,2,1093,1252.0,1,7.98,7.98,Store,0.0

In [3]:
df_Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641843 entries, 0 to 641842
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   date          641843 non-null  object
 1   store_id      641843 non-null  int64
 2   sku_id        641843 non-null  int64
 3   customer_id   482022 non-null  float64
 4   quantity      641843 non-null  int64
 5   unit_price    641843 non-null  float64
 6   total_value   641843 non-null  float64
 7   channel       641843 non-null  object
 8   discount_pct  641843 non-null  float64
dtypes: float64(4), int64(3), object(2)
memory usage: 44.1+ MB

In [4]:
df_Sales.describe()

,store_id,sku_id,customer_id,quantity,unit_price,total_value,discount_pct
count,641843.000000,641843.000000,482022.000000,641843.000000,641843.000000,641843.000000,641843.000000
mean,25.491081,1100.547835,2504.986828,2.613120,44.109242,114.069845,5.411316
std,14.437269,57.684158,1442.340254,1.481563,48.984342,157.206354,8.664765
min,1.000000,1001.000000,1.000000,1.000000,1.700000,1.700000,0.000000
25%,13.000000,1051.000000,1260.000000,1.000000,14.280000,27.320000,0.000000
50%,25.000000,1101.000000,2507.000000,2.000000,24.330000,57.660000,0.000000
75%,38.000000,1150.000000,3752.000000,4.000000,49.570000,129.550000,10.000000
max,50.000000,1200.000000,5000.000000,6.000000,245.380000,1472.280000,35.000000

In [5]:
df_Sales.isnull().sum()

date                 0
store_id             0
sku_id               0
customer_id     159821
quantity             0
unit_price           0
total_value          0
channel              0
discount_pct         0
dtype: int64

In [6]:
df_Sales.duplicated().sum()

45

In [7]:
df_Sales.drop_duplicates(inplace=True)

In [8]:
df_Sales.duplicated().sum()

0

In [9]:
df_Sales['date']=pd.to_datetime(df_Sales['date'])

In [10]:
df_Sales.info()
df_Sales.head()

<class 'pandas.core.frame.DataFrame'>
Index: 641798 entries, 0 to 641842
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   date          641798 non-null  datetime64[ns]
 1   store_id      641798 non-null  int64
 2   sku_id        641798 non-null  int64
 3   customer_id   482021 non-null  float64
 4   quantity      641798 non-null  int64
 5   unit_price    641798 non-null  float64
 6   total_value   641798 non-null  float64
 7   channel       641798 non-null  object
 8   discount_pct  641798 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(1)
memory usage: 49.0+ MB

,date,store_id,sku_id,customer_id,quantity,unit_price,total_value,channel,discount_pct
0,2021-01-01,26,1124,2961.0,1,20.08,20.08,Store,15.0
1,2021-01-01,19,1035,NaN,3,208.57,625.71,Store,15.0
2,2021-01-01,38,1088,NaN,1,17.99,17.99,Website,15.0
3,2021-01-01,3,1164,3694.0,6,196.24,1177.44,Website,0.0
4,2021-01-01,2,1093,1252.0,1,7.98,7.98,Store,0.0

In [11]:
df_Sales['channel']=df_Sales['channel'].astype('string')

In [12]:
df_Sales.dtypes

date            datetime64[ns]
store_id                 int64
sku_id                   int64
customer_id            float64
quantity                 int64
unit_price             float64
total_value            float64
channel         string[python]
discount_pct           float64
dtype: object

In [38]:
df_Sales['promo_id']=None
##df_Sales.to_csv('sales_final.csv', index=False)

In [39]:
df_Sales.head()

,date,store_id,sku_id,customer_id,quantity,unit_price,total_value,channel,discount_pct,promo_id
0,2021-01-01,26,1124,2961.0,1,20.08,20.08,Store,15.0,None
1,2021-01-01,19,1035,NaN,3,208.57,625.71,Store,15.0,None
2,2021-01-01,38,1088,NaN,1,17.99,17.99,Website,15.0,None
3,2021-01-01,3,1164,3694.0,6,196.24,1177.44,Website,0.0,None
4,2021-01-01,2,1093,1252.0,1,7.98,7.98,Store,0.0,None

In [42]:
df_Promo=pd.read_csv('bm_promotions.csv')
df_Promo.head()

,promo_name,start_date,end_date,discount_pct,promo_type,promo_id
0,Ramadan Sale 2021,2021-04-13,2021-05-12,25,Ramadan,1
1,Eid Al Fitr Sale 2021,2021-05-13,2021-05-15,20,Eid,2
2,Eid Al Adha Sale 2021,2021-07-20,2021-07-22,25,Eid,3
3,Dubai Shopping Festival 2021,2021-01-01,2021-02-28,15,DSF,4
4,Black Friday 2021,2021-11-26,2021-11-28,30,Black Friday,5

In [15]:
df_Promo.info()
df_Promo.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   promo_name    33 non-null     object
 1   start_date    33 non-null     object
 2   end_date      33 non-null     object
 3   discount_pct  33 non-null     int64
 4   promo_type    33 non-null     object
 5   promo_id      33 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.7+ KB

0

In [16]:
df_Promo['start_date']=pd.to_datetime(df_Promo['start_date'])
df_Promo['end_date']=pd.to_datetime(df_Promo['end_date'])

In [17]:
df_Promo.info()
df_Promo.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   promo_name    33 non-null     object
 1   start_date    33 non-null     datetime64[ns]
 2   end_date      33 non-null     datetime64[ns]
 3   discount_pct  33 non-null     int64
 4   promo_type    33 non-null     object
 5   promo_id      33 non-null     int64
dtypes: datetime64[ns](2), int64(2), object(2)
memory usage: 1.7+ KB

0

In [45]:
##inserting promo_id column in sales table
for idx, promo in df_Promo.iterrows():
    mask = (
        (df_Sales['date'] >= promo['start_date']) &
        (df_Sales['date'] <= promo['end_date']) &
        (df_Sales['discount_pct'] == promo['discount_pct'])
    )
    df_Sales.loc[mask, 'promo_id'] = promo['promo_id']

In [46]:
df_Sales.head()

,date,store_id,sku_id,customer_id,quantity,unit_price,total_value,channel,discount_pct,promo_id
0,2021-01-01,26,1124,2961.0,1,20.08,20.08,Store,15.0,4
1,2021-01-01,19,1035,NaN,3,208.57,625.71,Store,15.0,4
2,2021-01-01,38,1088,NaN,1,17.99,17.99,Website,15.0,4
3,2021-01-01,3,1164,3694.0,6,196.24,1177.44,Website,0.0,None
4,2021-01-01,2,1093,1252.0,1,7.98,7.98,Store,0.0,None

In [47]:
df_Sales.to_csv('sales_final.csv', index=False)
df_Promo.to_csv('promo_final.csv', index=False)

In [19]:
df_Inventory=pd.read_csv('bm_inventory.csv')
df_Inventory.head()

,store_id,sku_id,stock_on_hand,reorder_point,safety_stock,last_restock_date,snapshot_date
0,9,1101,300,92,46,2025-10-18,2025-10-31
1,9,1021,425,162,81,2025-10-21,2025-10-31
2,9,1200,252,85,42,2025-09-14,2025-10-31
3,9,1041,220,87,43,2025-10-13,2025-10-31
4,9,1092,170,80,40,2025-09-12,2025-10-31

In [20]:
df_Inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8735 entries, 0 to 8734
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   store_id           8735 non-null   int64
 1   sku_id             8735 non-null   int64
 2   stock_on_hand      8735 non-null   int64
 3   reorder_point      8735 non-null   int64
 4   safety_stock       8735 non-null   int64
 5   last_restock_date  8735 non-null   object
 6   snapshot_date      8735 non-null   object
dtypes: int64(5), object(2)
memory usage: 477.8+ KB

In [21]:
df_Inventory['last_restock_date']=pd.to_datetime(df_Inventory['last_restock_date'])
df_Inventory['snapshot_date']=pd.to_datetime(df_Inventory['snapshot_date'])

In [22]:
df_Inventory.info()
df_Inventory.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8735 entries, 0 to 8734
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   store_id           8735 non-null   int64
 1   sku_id             8735 non-null   int64
 2   stock_on_hand      8735 non-null   int64
 3   reorder_point      8735 non-null   int64
 4   safety_stock       8735 non-null   int64
 5   last_restock_date  8735 non-null   datetime64[ns]
 6   snapshot_date      8735 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(5)
memory usage: 477.8 KB

0

In [23]:
df_Inventory.to_csv('inventory_final.csv',index=False)

In [24]:
df_Items=pd.read_csv('bm_skus.csv')
df_Items.head()

,sku_id,sku_name,category,subcategory,unit_price,cost_price,brand
0,1001,Electronics_Chargers_1001,Electronics,Chargers,164.56,103.44,Budget
1,1002,Dairy_Cream_1002,Dairy,Cream,13.73,8.96,Local
2,1003,Household_Cleaning Supplies_1003,Household,Cleaning Supplies,12.00,7.47,BlueMart
3,1004,Beverages_Juices_1004,Beverages,Juices,24.82,17.58,International
4,1005,Household_Paper Products_1005,Household,Paper Products,17.70,13.68,Budget

In [25]:
df_Items.info()
df_Items.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sku_id       200 non-null    int64
 1   sku_name     200 non-null    object
 2   category     200 non-null    object
 3   subcategory  200 non-null    object
 4   unit_price   200 non-null    float64
 5   cost_price   200 non-null    float64
 6   brand        200 non-null    object
dtypes: float64(2), int64(1), object(4)
memory usage: 11.1+ KB

0

In [26]:
df_Items.to_csv('items_final.csv',index=False)

In [27]:
df_Stores=pd.read_csv('bm_stores.csv')
df_Stores.head()

,store_id,store_name,city,store_type,opening_date
0,9,BlueMart Store 09,Abu Dhabi,Mall,2017-01-01 00:00:00.000000000
1,10,BlueMart Store 10,Abu Dhabi,Mall,2017-01-31 00:00:00.000000000
2,11,BlueMart Store 11,Dubai,Mall,2017-03-02 00:00:00.000000000
3,12,BlueMart Store 12,Sharjah,Mall,2017-04-01 00:00:00.000000000
4,13,BlueMart Store 13,Sharjah,Community,2017-05-01 00:00:00.000000000

In [28]:
df_Stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   store_id      50 non-null     int64
 1   store_name    50 non-null     object
 2   city          50 non-null     object
 3   store_type    50 non-null     object
 4   opening_date  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [29]:
df_Stores['opening_date']=pd.to_datetime(df_Stores['opening_date'])

In [30]:
df_Stores.info()
df_Stores.head()
df_Stores.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   store_id      50 non-null     int64
 1   store_name    50 non-null     object
 2   city          50 non-null     object
 3   store_type    50 non-null     object
 4   opening_date  50 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 2.1+ KB

0

In [31]:
df_Stores.to_csv('stores_final.csv',index=False)

In [32]:
df_Customer=pd.read_csv('bm_customers.csv')
df_Customer.head()

,cust_id,age,gender,city,loyalty_segment,preferred_channel,registration_date
0,1,50,Male,Sharjah,Silver,MobileApp,2024-06-29
1,2,20,Female,Abu Dhabi,Gold,Store,2024-12-03
2,3,55,Male,Dubai,Gold,Website,2023-09-18
3,4,25,Male,Abu Dhabi,Platinum,Store,2022-01-02
4,5,20,Female,Abu Dhabi,Silver,MobileApp,2021-09-13

In [33]:
df_Customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cust_id            5000 non-null   int64
 1   age                5000 non-null   int64
 2   gender             5000 non-null   object
 3   city               5000 non-null   object
 4   loyalty_segment    5000 non-null   object
 5   preferred_channel  5000 non-null   object
 6   registration_date  5000 non-null   object
dtypes: int64(2), object(5)
memory usage: 273.6+ KB

In [34]:
df_Customer.rename(columns={'cust_id':'customer_id'},inplace=True)
df_Customer['gender']=df_Customer['gender'].replace('Female','F')
df_Customer['gender']=df_Customer['gender'].replace('Male','M')

In [35]:
df_Customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        5000 non-null   int64
 1   age                5000 non-null   int64
 2   gender             5000 non-null   object
 3   city               5000 non-null   object
 4   loyalty_segment    5000 non-null   object
 5   preferred_channel  5000 non-null   object
 6   registration_date  5000 non-null   object
dtypes: int64(2), object(5)
memory usage: 273.6+ KB

In [36]:
df_Customer['registration_date']=pd.to_datetime(df_Customer['registration_date'])
df_Customer.info()
df_Customer.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        5000 non-null   int64
 1   age                5000 non-null   int64
 2   gender             5000 non-null   object
 3   city               5000 non-null   object
 4   loyalty_segment    5000 non-null   object
 5   preferred_channel  5000 non-null   object
 6   registration_date  5000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 273.6+ KB

0

In [37]:
df_Customer.to_csv('customer_final.csv', index=False)